doc/org-mode/actions/confirm.org

#+TITLE: Confirm Action Element
#+STYLE: <LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
#+AUTHOR: Rusty Klophaus (@rklophaus)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 
#+TEXT: [[file:../index.org][Getting Started]] | [[file:../api.org][API]] | [[file:../elements.org][Elements]] | Actions | [[file:../validators.org][Validators]] | [[file:../handlers.org][Handlers]] | [[file:../about.org][About]]

* Confirm Action - #confirm {}

  This action tells Nitrogen to trigger a Javascript confirmation box. (ok/cancel).

** Usage

#+BEGIN_SRC erlang
   wf:wire(#confirm { text="Do you want to continue?", postback=continue })
#+END_SRC

** Attributes

   + text - (/string/) :: The text of the confirm box.

   + postback - (/Erlang term/) :: If 'ok' is clicked, Nitrogen will issue a postback with this term.

** Callbacks

*** event(Tag)

    Called when the ok button is clicked. Tag is specified in the 'postback' attribute.

** See Also

   + [[./base.html][base element]]

   + [[./alert.html][alert element]]

 
